; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	spectrograph1 - mode
	infrared2 - mode
	image3 - mode
	infrared0 - mode
	GroundStation1 - direction
	Star6 - direction
	GroundStation7 - direction
	Star8 - direction
	GroundStation10 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	GroundStation15 - direction
	Star17 - direction
	Star24 - direction
	Star5 - direction
	GroundStation25 - direction
	GroundStation9 - direction
	Star20 - direction
	Star19 - direction
	Star27 - direction
	Star28 - direction
	GroundStation16 - direction
	Star29 - direction
	Star23 - direction
	GroundStation4 - direction
	GroundStation21 - direction
	Star2 - direction
	GroundStation18 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation26 - direction
	GroundStation22 - direction
	GroundStation11 - direction
	Star30 - direction
	Planet31 - direction
	Star32 - direction
	Planet33 - direction
	Phenomenon34 - direction
	Planet35 - direction
	Phenomenon36 - direction
	Phenomenon37 - direction
	Planet38 - direction
	Phenomenon39 - direction
	Phenomenon40 - direction
	Phenomenon41 - direction
	Planet42 - direction
	Phenomenon43 - direction
	Star44 - direction
	Phenomenon45 - direction
	Phenomenon46 - direction
	Planet47 - direction
	Planet48 - direction
	Phenomenon49 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image3)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation25)
	(calibration_target instrument0 Star5)
	(supports instrument1 image3)
	(calibration_target instrument1 Star20)
	(calibration_target instrument1 Star28)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 Star19)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument2 image3)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation26)
	(calibration_target instrument2 Star27)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation22)
	(calibration_target instrument2 Star19)
	(calibration_target instrument2 Star20)
	(calibration_target instrument2 Star29)
	(supports instrument3 infrared2)
	(supports instrument3 image3)
	(calibration_target instrument3 Star23)
	(calibration_target instrument3 Star29)
	(calibration_target instrument3 GroundStation16)
	(calibration_target instrument3 Star28)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation11)
	(calibration_target instrument4 GroundStation22)
	(calibration_target instrument4 GroundStation26)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation18)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 GroundStation21)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star24)
)
(:goal (and
	(pointing satellite0 Star28)
	(pointing satellite2 GroundStation11)
	(have_image Star30 spectrograph1)
	(have_image Planet31 spectrograph1)
	(have_image Star32 infrared0)
	(have_image Planet33 infrared2)
	(have_image Phenomenon34 infrared2)
	(have_image Planet35 infrared2)
	(have_image Phenomenon36 infrared2)
	(have_image Phenomenon37 infrared2)
	(have_image Planet38 infrared0)
	(have_image Phenomenon39 infrared2)
	(have_image Phenomenon40 infrared2)
	(have_image Phenomenon41 image3)
	(have_image Planet42 image3)
	(have_image Phenomenon43 infrared0)
	(have_image Star44 infrared2)
	(have_image Phenomenon45 infrared0)
	(have_image Phenomenon46 infrared0)
	(have_image Planet47 infrared2)
	(have_image Planet48 infrared2)
	(have_image Phenomenon49 infrared0)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 22
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 22
3. (turn_to satellite2 groundstation11 star24)
   deleted: (pointing satellite2 star24)
   added: (pointing satellite2 groundstation11)
   goals met: 1 of 22
4. (turn_to satellite1 planet31 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet31)
   goals met: 1 of 22
5. (turn_to satellite0 phenomenon34 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon34)
   goals met: 1 of 22
6. (turn_to satellite1 star29 planet31)
   deleted: (pointing satellite1 planet31)
   added: (pointing satellite1 star29)
   goals met: 1 of 22
7. (calibrate satellite1 instrument2 star29)
   added: (calibrated instrument2)
   goals met: 1 of 22
8. (turn_to satellite1 phenomenon41 star29)
   deleted: (pointing satellite1 star29)
   added: (pointing satellite1 phenomenon41)
   goals met: 1 of 22
9. (take_image satellite1 phenomenon41 instrument2 image3)
   added: (have_image phenomenon41 image3)
   goals met: 2 of 22
10. (turn_to satellite1 planet31 phenomenon41)
   deleted: (pointing satellite1 phenomenon41)
   added: (pointing satellite1 planet31)
   goals met: 2 of 22
11. (take_image satellite1 planet31 instrument2 spectrograph1)
   added: (have_image planet31 spectrograph1)
   goals met: 3 of 22
12. (turn_to satellite1 planet42 planet31)
   deleted: (pointing satellite1 planet31)
   added: (pointing satellite1 planet42)
   goals met: 3 of 22
13. (take_image satellite1 planet42 instrument2 image3)
   added: (have_image planet42 image3)
   goals met: 4 of 22
14. (turn_to satellite1 star30 planet42)
   deleted: (pointing satellite1 planet42)
   added: (pointing satellite1 star30)
   goals met: 4 of 22
15. (take_image satellite1 star30 instrument2 spectrograph1)
   added: (have_image star30 spectrograph1)
   goals met: 5 of 22
16. (turn_to satellite0 star5 phenomenon34)
   deleted: (pointing satellite0 phenomenon34)
   added: (pointing satellite0 star5)
   goals met: 5 of 22
17. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 5 of 22
18. (turn_to satellite0 phenomenon34 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon34)
   goals met: 5 of 22
19. (take_image satellite0 phenomenon34 instrument0 infrared2)
   added: (have_image phenomenon34 infrared2)
   goals met: 6 of 22
20. (turn_to satellite0 phenomenon36 phenomenon34)
   deleted: (pointing satellite0 phenomenon34)
   added: (pointing satellite0 phenomenon36)
   goals met: 6 of 22
21. (take_image satellite0 phenomenon36 instrument0 infrared2)
   added: (have_image phenomenon36 infrared2)
   goals met: 7 of 22
22. (turn_to satellite0 phenomenon37 phenomenon36)
   deleted: (pointing satellite0 phenomenon36)
   added: (pointing satellite0 phenomenon37)
   goals met: 7 of 22
23. (take_image satellite0 phenomenon37 instrument0 infrared2)
   added: (have_image phenomenon37 infrared2)
   goals met: 8 of 22
24. (turn_to satellite0 phenomenon39 phenomenon37)
   deleted: (pointing satellite0 phenomenon37)
   added: (pointing satellite0 phenomenon39)
   goals met: 8 of 22
25. (take_image satellite0 phenomenon39 instrument0 infrared2)
   added: (have_image phenomenon39 infrared2)
   goals met: 9 of 22
26. (turn_to satellite0 phenomenon40 phenomenon39)
   deleted: (pointing satellite0 phenomenon39)
   added: (pointing satellite0 phenomenon40)
   goals met: 9 of 22
27. (take_image satellite0 phenomenon40 instrument0 infrared2)
   added: (have_image phenomenon40 infrared2)
   goals met: 10 of 22
28. (turn_to satellite0 phenomenon43 phenomenon40)
   deleted: (pointing satellite0 phenomenon40)
   added: (pointing satellite0 phenomenon43)
   goals met: 10 of 22
29. (take_image satellite0 phenomenon43 instrument0 infrared0)
   added: (have_image phenomenon43 infrared0)
   goals met: 11 of 22
30. (turn_to satellite0 phenomenon45 phenomenon43)
   deleted: (pointing satellite0 phenomenon43)
   added: (pointing satellite0 phenomenon45)
   goals met: 11 of 22
31. (take_image satellite0 phenomenon45 instrument0 infrared0)
   added: (have_image phenomenon45 infrared0)
   goals met: 12 of 22
32. (turn_to satellite0 phenomenon46 phenomenon45)
   deleted: (pointing satellite0 phenomenon45)
   added: (pointing satellite0 phenomenon46)
   goals met: 12 of 22
33. (take_image satellite0 phenomenon46 instrument0 infrared0)
   added: (have_image phenomenon46 infrared0)
   goals met: 13 of 22
34. (turn_to satellite0 phenomenon49 phenomenon46)
   deleted: (pointing satellite0 phenomenon46)
   added: (pointing satellite0 phenomenon49)
   goals met: 13 of 22
35. (take_image satellite0 phenomenon49 instrument0 infrared0)
   added: (have_image phenomenon49 infrared0)
   goals met: 14 of 22
36. (turn_to satellite0 planet33 phenomenon49)
   deleted: (pointing satellite0 phenomenon49)
   added: (pointing satellite0 planet33)
   goals met: 14 of 22
37. (take_image satellite0 planet33 instrument0 infrared2)
   added: (have_image planet33 infrared2)
   goals met: 15 of 22
38. (turn_to satellite0 planet35 planet33)
   deleted: (pointing satellite0 planet33)
   added: (pointing satellite0 planet35)
   goals met: 15 of 22
39. (take_image satellite0 planet35 instrument0 infrared2)
   added: (have_image planet35 infrared2)
   goals met: 16 of 22
40. (turn_to satellite0 planet38 planet35)
   deleted: (pointing satellite0 planet35)
   added: (pointing satellite0 planet38)
   goals met: 16 of 22
41. (take_image satellite0 planet38 instrument0 infrared0)
   added: (have_image planet38 infrared0)
   goals met: 17 of 22
42. (turn_to satellite0 planet47 planet38)
   deleted: (pointing satellite0 planet38)
   added: (pointing satellite0 planet47)
   goals met: 17 of 22
43. (take_image satellite0 planet47 instrument0 infrared2)
   added: (have_image planet47 infrared2)
   goals met: 18 of 22
44. (turn_to satellite0 planet48 planet47)
   deleted: (pointing satellite0 planet47)
   added: (pointing satellite0 planet48)
   goals met: 18 of 22
45. (take_image satellite0 planet48 instrument0 infrared2)
   added: (have_image planet48 infrared2)
   goals met: 19 of 22
46. (turn_to satellite0 star28 planet48)
   deleted: (pointing satellite0 planet48)
   added: (pointing satellite0 star28)
   goals met: 20 of 22
47. (turn_to satellite0 star32 star28)
   deleted: (pointing satellite0 star28)
   added: (pointing satellite0 star32)
   goals met: 19 of 22
48. (take_image satellite0 star32 instrument0 infrared0)
   added: (have_image star32 infrared0)
   goals met: 20 of 22
49. (turn_to satellite0 star28 star32)
   deleted: (pointing satellite0 star32)
   added: (pointing satellite0 star28)
   goals met: 21 of 22
50. (turn_to satellite0 star44 star28)
   deleted: (pointing satellite0 star28)
   added: (pointing satellite0 star44)
   goals met: 20 of 22
51. (take_image satellite0 star44 instrument0 infrared2)
   added: (have_image star44 infrared2)
   goals met: 21 of 22
52. (turn_to satellite0 star28 star44)
   deleted: (pointing satellite0 star44)
   added: (pointing satellite0 star28)
   goals met: 22 of 22
